Add updated doc
