--- a/docs/3.9/scalardb-cluster/getting-started-with-scalardb-cluster.md
+++ b/docs/3.9/scalardb-cluster/getting-started-with-scalardb-cluster.md
@@ -1,80 +1,146 @@
+
+The following diagram shows the system architecture of the sample application:
+
+```mermaid
+stateDiagram-v2  
+  state "Schema Loader<br/>(indirect client mode)" as SL
+  state "Sample application using the Java API<br/>(indirect client mode)" as SA
+  state "Kubernetes Cluster" as KC
+  state "Service (Envoy)" as SE
+  state "Pod" as P1
+  state "Pod" as P2
+  state "Pod" as P3
+  state "Envoy" as E1
+  state "Envoy" as E2
+  state "Envoy" as E3
+  state "Service (ScalarDB Cluster)" as SSC
+  state "ScalarDB Cluster" as SC1
+  state "ScalarDB Cluster" as SC2
+  state "ScalarDB Cluster" as SC3
+  state "PostgreSQL" as PSQL
+  SL --> SE
+  SA --> SE
+  state KC {
+    SE --> E1
+    SE --> E2
+    SE --> E3
+    state P1 {
+      E1 --> SSC
+      E2 --> SSC
+      E3 --> SSC
+    }
+      SSC --> SC1
+      SSC --> SC2
+      SSC --> SC3
+    state P2 {
+      SC1 --> PSQL
+      SC1 --> SC2
+      SC1 --> SC3
+      SC2 --> PSQL
+      SC2 --> SC1
+      SC2 --> SC3
+      SC3 --> PSQL
+      SC3 --> SC1
+      SC3 --> SC2
+    }
+    state P3 {
+      PSQL
+    }
+  }
+```
+
+### What you can do in this sample application
+
@@
-The following diagram shows the system architecture of the sample application:
+### Clone the ScalarDB samples repository
 
-```
-                                 +------------------------------------------------------------------------------------------------------------------------------+
-                                 | [Kubernetes Cluster]                                                                                                         |
-                                 |                                                                                                                              |
-                                 |                          [Pod]                                                     [Pod]                         [Pod]       |
- +------------------------+      |                                                                                                                              |
- |     Schema Loader      |      |                        +-------+                                          +-----------------------+                          |
- | (indirect client mode) | --+  |                  +---> | Envoy | ---+                               +---> | ScalarDB Cluster Node | ---+                     |
- +------------------------+   |  |                  |     +-------+    |                               |     +-----------------------+    |                     |
-                              |  |                  |                  |                               |                                  |                     |
-                              |  |   +---------+    |     +-------+    |     +--------------------+    |     +-----------------------+    |     +------------+  |
-                              +--+-> | Service | ---+---> | Envoy | ---+---> |      Service       | ---+---> | ScalarDB Cluster Node | ---+---> | PostgreSQL |  |
-                              |  |   | (Envoy) |    |     +-------+    |     | (ScalarDB Cluster) |    |     +-----------------------+    |     +------------+  |
- +------------------------+   |  |   +---------+    |                  |     +--------------------+    |                                  |                     |
- |   Sample application   |   |  |                  |     +-------+    |                               |     +-----------------------+    |                     |
- |     with Java API      | --+  |                  +---> | Envoy | ---+                               +---> | ScalarDB Cluster Node | ---+                     |
- | (indirect client mode) |      |                        +-------+                                          +-----------------------+                          |
- +------------------------+      |                                                                                                                              |
-                                 +------------------------------------------------------------------------------------------------------------------------------+
+Open **Terminal**, then clone the ScalarDB samples repository by running the following command:
+
+```console
+$ git clone https://github.com/scalar-labs/scalardb-samples
 ```
 
-## Step 1. Clone the ScalarDB Samples repository
+Then, go to the directory that contains the sample application by running the following command:
